app/Controllers/Login.php

SELECT *
FROM `login`
WHERE `Usuario` = 'Vivian'
AND `Senha` = '123456'
 LIMIT 1
---
    public function autenticar() {
        $dados = $this->request -> getVar();

        $login_model = new LoginModel();

        $login = $login_model
                        ->where('Usuario', $dados['Usuario'])
                        ->where('Senha', $dados['Senha'])
                        ->first();